/* ===== Generic ===== */

/* Generic Cancel button title, used in SKConversation NSErrorFromPREMIUM_VIDEO_STATUS */
"BUTTONTITLE_CANCEL" = "Cancel";

/* ===== SkyLib Properties ===== */

/* List item title for user's home phone number. */
"CONTACT_PHONE_HOME" = "Home";

/* List item title for user's office phone number */
"CONTACT_PHONE_OFFICE" = "Office";

/* List item title for user's mobile phone number. */
"CONTACT_PHONE_MOBILE" = "Mobile";

/* List item title for user's (possible) other phone number(s). */
"CONTACT_PHONE_OTHER" = "Other";

/* Format to use to wrap guest contact displays */
"CONTACT_GUEST_FORMAT" = "%@ (Guest)";

/* All known contacts group title */
"CONTACT_GROUP_ALL_KNOWN_CONTACTS" = "All Known Contacts";

/* All buddies group title */
"CONTACT_GROUP_ALL_BUDDIES" = "All Contacts";

/* Skype group title */
"CONTACT_GROUP_SKYPE_BUDDIES" = "Skype Contacts";

/* SkypeOut group title */
"CONTACT_GROUP_SKYPEOUT_BUDDIES" = "Saved Phone Numbers";

/* Online buddies group title */
"CONTACT_GROUP_ONLINE_BUDDIES" = "Online Contacts";

/* Unknown or pending auth group title */
"CONTACT_GROUP_UNKNOWN_OR_PENDINGAUTH_BUDDIES" = "Requests Sent";

/* Recently contacted group title */
"CONTACT_GROUP_RECENTLY_CONTACTED_CONTACTS" = "Recently Contacted";

/* Contacts waiting my auth group title */
"CONTACT_GROUP_CONTACTS_WAITING_MY_AUTHORIZATION" = "Requests Received";

/* Authorized by me group title */
"CONTACT_GROUP_CONTACTS_AUTHORIZED_BY_ME" = "Accepted Requests";

/* Blocked group title */
"CONTACT_GROUP_CONTACTS_BLOCKED_BY_ME" = "Blocked Contacts";

/* Ungrouped contacts group title */
"CONTACT_GROUP_UNGROUPED_BUDDIES" = "Ungrouped Contacts";

/* Windows Live ID contacts group title */
"CONTACT_GROUP_PASSPORT_CONTACTS" = "Messenger";

/* Suggested contacts group title */
"CONTACT_GROUP_SCD_CONTACTS" = "Suggested Contacts";

/* New group default title */
"CONTACT_GROUP_NEW_GROUP" = "Untitled List";

/* Default message sent to contacts from whom we are requesting authorization */
"CONTACT_AUTH_REQUEST_DEFAULT_MESSAGE" = "Please add me as a contact";

/*  */
"ECHO123_CONTACT_FULLNAME" = "Skype test call";

/*  */
"ECHO123_CONTACT_LANGUAGES" = "en";

/*  */
"ECHO123_CONTACT_HOMEPAGE" = "www.skype.com/go/help";

/* Automatic sound test service mood message. */
"ECHO123_CONTACT_ABOUT" = "Hi, this is the Skype test call robot. Add me to your contacts and give me a call to check your sound setup. See http://www.skype.com/go/help for more assistance. Thanks.";

/*  */
"ECHO123_CONTACT_MOOD_TEXT" = "Call me to test your sound";


/* UNPLACED call status used when a call is initialized, but not connected to the network yet. */
"CALL_STATUS_UNPLACED" = "Placing your call";

/* ROUTING call status used when a call is being routed by the network but not ringing yet. */
"CALL_STATUS_ROUTING" = "Placing your call";

/* CANCELLED call status indicating that the outgoing call was cancelled by the user. */
"CALL_STATUS_CANCELLED" = "Call cancelled";

/* FAILED call status used when the call failed. */
"CALL_STATUS_FAILED" = "Call failed";

/* RINGING_OUT call status used when a call is ringing for the remote party. */
"CALL_STATUS_RINGING_OUT" = "Ringing";

/* RINGING_IN call status used when a call is ringing locally. */
"CALL_STATUS_RINGING_IN" = "Calling";

/* LOCALHOLD call status indicating that the user put the call on hold. */
"CALL_STATUS_LOCALHOLD" = "Call on hold";

/* REMOTEHOLD call status indicating that the call is on hold by the remote party. */
"CALL_STATUS_REMOTEHOLD" = "You’re on hold";

/* FINISHED call status indicating that the call was finished. */
"CALL_STATUS_FINISHED" = "Finished";

/* MISSED call status indicating that the incoming call was finished before it got answered. */
"CALL_STATUS_MISSED" = "Missed";

/* REFUSED call status indicating that the remote party declined the call. */
"CALL_STATUS_REFUSED" = "Declined";

/* BUSY call status indicating that the remote party was already in a call. */
"CALL_STATUS_BUSY" = "Busy";

/* DROPPED call status indicating that the network connection was lost during the call. */
"CALL_STATUS_DROPPED" = "Connection lost";

/* VOICEMAIL call status indicating that the call was diverted to voicemail. */
"CALL_STATUS_VOICEMAIL" = "Voice message";

/* VM_RECORDING call status while recording the voicemail. */
"CALL_STATUS_VM_RECORDING" = "Recording voice message";

/* VM_UPLOADING call status while sending the voicemail. */
"CALL_STATUS_VM_UPLOADING" = "Sending voice message";

/* VM_SENT call status after the voicemail was sent. */
"CALL_STATUS_VM_SENT" = "Voice message sent";

/* VM_CANCELLED call status when the recording or sending of the voicemail was cancelled. */
"CALL_STATUS_VM_CANCELLED" = "Voice message cancelled";

/* VM_FAILED call status when the recording or sending of the voicemail failed. */
"CALL_STATUS_VM_FAILED" = "Voice message failed";

/* ===== Wallet Transacation ===== */
/* Title of instrument name in popup button (args: instrument name ["Visa"], number ["****1234"]) */
"WALLET_INSTRUMENT_DISPLAY_NAME_FORMAT" = "%1$@ %2$@";


/* ===== PARTICIPANT_VOICE_STATUS ===== */ 

/* VOICE_CONNECTING status used when a call is being routed by the network but not ringing yet. */
"PARTICIPANT_VOICE_STATUS_CONNECTING" = "Connecting";

/* RINGING status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_RINGING" = "Ringing";

/* EARLY_MEDIA status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_EARLY_MEDIA" = "Ringing";

/* ON_HOLD status when a participant is held. */
"PARTICIPANT_VOICE_STATUS_ON_HOLD" = "On Hold";

/* STOPPED status when a participant has stopped. */
"PARTICIPANT_VOICE_STATUS_STOPPED" = "Ended";

/* FACEBOOK calling */
"PARTICIPANT_VOICE_STATUS_CONNECTING_FACEBOOK" = "Calling on Facebook (Beta)";

/* ===== CONVERSATION_LOCAL_LIVESTATUS ===== */ 
"CONVERSATION_LOCAL_LIVESTATUS_STARTING" = "Calling…";
"CONVERSATION_LOCAL_LIVESTATUS_RINGING_FOR_ME" = "Calling…";
"CONVERSATION_LOCAL_LIVESTATUS_IM_LIVE" = "Call in progress";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_LOCALLY" = "On hold";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_REMOTELY" = "You’re on hold";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE" = "Call in progress";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE_FULL" = "Call is full";
"CONVERSATION_LOCAL_LIVESTATUS_PLAYING_VOICE_MESSAGE" = "Playing voice message greeting";
"CONVERSATION_LOCAL_LIVESTATUS_RECORDING_VOICE_MESSAGE" = "Recording voice message";
"CONVERSATION_LOCAL_LIVESTATUS_RECENTLY_LIVE" = "Recent call";
"CONVERSATION_LOCAL_LIVESTATUS_TRANSFERRING" = "Transferring this call";


/*  */
"CONVERSATION_POST_FILES_BODY" = "Posted files";

/* CONVERSATION Legacy chat message for older clients */
"CONVERSATION_VIDEOMESSAGE_LEGACY_MESSAGE" = "You’ve received a video message. View it at: %1, and open it using the code %2";

"CONVERSATION_XMM_LEGACY_MESSAGE" = "%1$@ - view it at %%1.";

"CONVERSATION_MEDIAMESSAGE_LEGACY_MESSAGE" = "To view this shared photo, go to: %1";
"CONVERSATION_XMM_MESSAGE_LEGACY_MESSAGE" = "To view this shared media, go to: %1";

/*  */
"CONTACT_AVAILABILITY_OFFLINE" = "Offline";
"CONTACT_AVAILABILITY_ONLINE" = "Online";
"CONTACT_AVAILABILITY_AWAY" = "Away";
"CONTACT_AVAILABILITY_DO_NOT_DISTURB" = "Do not disturb";
"CONTACT_AVAILABILITY_PENDING_AUTH" = "Pending contact request";
"CONTACT_AVAILABILITY_BLOCKED" = "Blocked";
"CONTACT_AVAILABILITY_OFFLINE_BUT_VM_ABLE" = "Offline with voice messaging";
"CONTACT_AVAILABILITY_OFFLINE_BUT_CF_ABLE" = "Forwarding calls";

/*  */
"CONTACT_AVAILABILITY_INVISIBLE" = "Invisible";
"CONTACT_AVAILABILITY_CONNECTING" = "Connecting";
"CONTACT_AVAILABILITY_SKYPEOUT" = "Phone number";

/*  */
"CONTACT_GENDER_FEMALE" = "Female";

/*  */
"CONTACT_GENDER_MALE" = "Male";

/* A hidden phone number. */
"CONTACT_UNKNOWN_PSTN_DISPLAYNAME" = "Unknown number";

/* Title for conversation with no participants */
"CONVERSATION_UNTITLED_DISPLAYNAME" = "Untitled";


"ACCOUNTMANAGER_LOGIN_STATUS" = "Signing in…";
"ACCOUNTMANAGER_CBLSYNC_STATUS" = "Loading contacts…";
"ACCOUNTMANAGER_UPGRADEDB_STATUS" = "Upgrading files…";


/* Chat info message when a party has been joined to the chat. %1$@ is the name of the user who did the adding, while %2$@ is the name of the added user. */
"ChatMessage::ADDEDMEMBERS_FORMATSTRING" = "%1$@ added %2$@";

/* Chat info message shown when user %@ has left the chat. */
"ChatMessage::LEFT_FORMATSTRING" = "%@ has left";

/* Chat info message when the first user ejected (threw out) the second user from the chat. */
"ChatMessage::KICKED_FORMATSTRING" = "%1$@ has removed %2$@";

/* Chat info message shown when a party has changed the chat topic. %1$@ is the user who did it, and %2$@ the new topic. */
"ChatMessage::SETTOPIC_FORMATSTRING" = "%1$@ has changed the chat topic to %2$@";

/* Chat item shown in place of the message to tell that the message has been removed by its writer. */
"CHATMESSAGE_MESSAGEREMOVED_TEXT" = "This message has been removed";

/* AV Preferences output device name */
"SAME_AS_SYSTEM_DEVICE_NAME" = "Same as System";


/* ===== SkyLib Error/Result Codes ===== */

/* sync errors at login/registration */
"LOGOUTREASON_NETWORKERROR" = "Can’t connect to Skype.";
"LOGOUTREASON_NETWORKERROR_RECOVERYSUGGESTION" = "Please check your network settings and try again.";

/* sync errors at registration */
"Account::INVALID_SKYPENAME" = "This Skype Name isn’t valid.";
"Account::INVALID_EMAIL" = "This email address isn’t valid.";
"Account::INVALID_EMAIL_RECOVERYSUGGESTION" = "Please check it and try again.";
"Account::UNACCEPTABLE_PASSWORD" = "This password isn’t valid.";
"Account::SKYPENAME_TAKEN" = "This Skype Name is already taken.";
"Account::SKYPENAME_TAKEN_RECOVERYSUGGESTION" = "Please enter a new one.";

/* sync errors at login */
"Account::NO_SUCH_IDENTITY" = "We didn’t recognise your Skype Name and password.";
"Account::INCORRECT_PASSWORD" = "We didn’t recognise your Skype Name and password.";
"Account::TOO_MANY_LOGIN_ATTEMPTS" = "Too many failed sign-in attempts.";
"Account::TOO_MANY_LOGIN_ATTEMPTS_RECOVERYSUGGESTION" = "Please try again later.";

/* async errors (can happen anytime while logged in) */
"Account::PASSWORD_HAS_CHANGED" = "Your password has changed.";
"Account::PASSWORD_HAS_CHANGED_RECOVERYSUGGESTION" = "Please sign in with your new password.";

"LOGOUTREASON_GENERIC_RECOVERYSUGGESTION" = "Please try again.";

/* Account property validation error - NSLocalizedFailureReasonErrorKey [#HELLC-1021], [#WIN-364] */
"SkyLib::TOO_SHORT" = "Needs to be 6–20 characters long.";
"SkyLib::TOO_LONG" = "Needs to be 6–20 characters long.";
"SkyLib::CONTAINS_INVALID_CHAR" = "Invalid character e.g. Σ, à, ß.";
"SkyLib::CONTAINS_SPACE" = "Can’t contain a space or a tab.";
"SkyLib::SAME_AS_USERNAME" = "Too similar to your Skype Name.";
"SkyLib::INVALID_FORMAT" = "Invalid format.";
"SkyLib::CONTAINS_INVALID_WORD" = "Too easy to guess e.g. abcd, skype.";
"SkyLib::TOO_SIMPLE" = "Needs to have at least 1 letter and 1 number.";
"SkyLib::STARTS_WITH_INVALID_CHAR" = "Must start with a letter (A–Z).";

/* Account property validation error - NSLocalizedRecoverySuggestionErrorKey */
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Try a longer Skype name.";
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Try a longer password.";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Try a shorter Skype name.";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Try a shorter password.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Try a new Skype name.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Try a new password.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_EMAILS" = "Try a new email address.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION" = "Try a new value.";

/* Account password change error - NSLocalizedFailureReasonErrorKey */
"Account::PWD_INVALID_OLD_PASSWORD" = "The password is incorrect.";
"Account::PWD_SERVER_CONNECT_FAILED" = "Couldn’t connect to server.";
"Account::PWD_MUST_DIFFER_FROM_OLD" = "The new password must differ from the old one.";
"Account::PWD_INVALID_NEW_PWD" = "The password isn’t valid.";
"Account::PWD_MUST_LOG_IN_TO_CHANGE" =  "Must sign in to change your password.";

/* COMMITFAILED status received when committing a server-side property change. */
"ACCOUNT_COMMITSTATUS_COMMIT_FAILED" = "Your change couldn’t be saved. Check the setting and try again.";

"ACCOUNT_NOCREDIT" = "No credit";
"ACCOUNT_FREECALL" = "free call";

/* Conversation file transfer errors */
"SkyLib::TRANSFER_BAD_FILENAME" = "The file name is not valid";
"SkyLib::TRANSFER_OPEN_FAILED" = "Failed opening file";
"SkyLib::TRANSFER_TOO_MANY_PARALLEL" = "Too many simultaneous file transfers";

/* ===== SKSkypeKitErrorDomain Errors ===== */

/* SKErrorOffline */
"SKERROR_OFFLINE_DESCRIPTION" = "You’re offline.";

"SKERROR_OFFLINE_CALL_FAILUREREASON" = "You need to be online to make a call.";
"SKERROR_OFFLINE_CONTACTSEARCH_FAILUREREASON" = "You can’t search for contacts when you’re offline. Change your status and try again.";
"SKERROR_OFFLINE_SMS_FAILUREREASON" = "You need to be online to send an SMS.";

/* [#HELLC-894] */
"SKERROR_OFFLINE_VOICEMAIL_FAILUREREASON" = "You need to be online to play this message.";

/* Alert sheet title */
"SKERROR_CANNOT_SET_BODY_SMS_DESCRIPTION" = "Can’t set body of current SMS.";


/* SKErrorInsufficientFunds */
"Sms::INSUFFICIENT_FUNDS" = "You don’t have enough Skype Credit to send an SMS.";
"CMEMBER_PSTN_STATUSTEXT_INSUFFICIENTCREDIT" = "You need Skype Credit to call this number.";

/* SKErrorInvalidContact */
"SKERROR_INVALIDCONTACT" = "That isn’t a valid Skype Name or phone number.";

/* SKErrorCallOfflineLyncContact */
"SKERROR_OFFLINELYNCCONTACT_CALL_FAILUREREASON" = "You can‘t call this Lync contact because they are offline.";

/* SKErrorBlockedContact */
"SKERROR_CONTACTBLOCKED_CALL_FAILUREREASON" = "You can’t call this person because you’ve blocked them.";
"SKERROR_CONTACTBLOCKED_CHAT_FAILUREREASON" = "You can’t chat with this person because you’ve blocked them.";
"SKERROR_CONTACTBLOCKED_SMS_FAILUREREASON" = "You can’t send SMS to this person because you’ve blocked them.";
"SKERROR_CONTACTBLOCKED_ADD_FAILUREREASON" = "You can’t add this person because you’ve blocked them.";

/* SKErrorCantTalkToYourself */
"SKERROR_CANTTALKTOYOURSELF_CALL_FAILUREREASON" = "You can’t call yourself.";
"SKERROR_CANTTALKTOYOURSELF_CHAT_FAILUREREASON" = "You can’t chat with yourself.";
"SKERROR_CANTTALKTOYOURSELF_ADD_FAILUREREASON"  = "You can’t add yourself.";

/* SKErrorCantJoinConversation */
"SKERROR_CANTJOINCONVERSATION_FAILUREREASON" = "You can’t join this conversation";

/* SKErrorCantFindConversation */
"SKERROR_CANTFINDCONVERSATION_FAILUREREASON" = "Can’t find this conversation";

/* SKErrorInvalidPSTNNumber */
"CMEMBER_PSTN_STATUSTEXT_INVALIDNUMBER" = "That isn’t a valid phone number.";

/* SKErrorEmergencyPSTNNumber */
"SKERROR_EMERGENCYCALL_FAILUREREASON" = "You can’t call this number because it is an emergency number.";
"SKERROR_EMERGENCYSMS_FAILUREREASON" = "You can’t send SMS to this number because it is an emergency number.";
"SKERROR_EMERGENCYADD_FAILUREREASON" = "You can’t add this number because it is an emergency number.";

/* SKErrorCallExists */
"SKERROR_CALLEXISTS_CALL" = "You need to end this call before you can start a new one.";
"SKERROR_CALLEXISTS_VOICEMAIL" = "To listen to a voice message, end this call first.";
"SKERROR_CALLFAILED" = "The call failed. Please try again.";

/* SKErrorTooManyChatParticipants */
"SKERROR_TOOMANYPARTICIPANTS_CHAT_DESCRIPTION" = "You have tried to start a conversation with too many contacts.";

/* SKErrorInvalidConversationIdentities */
"SKERROR_INVALIDCONVERSATIONIDENTITIES_DESCRIPTION" = "You can’t have a conversation with these contacts.";

/* CMEMBER_FAILUREREASON */
"CMEMBER_FAILUREREASON_CALLER_NOT_AUTHORIZED" = "You can’t call this person because they haven’t authorized you.";
"CMEMBER_FAILUREREASON_CALLER_NOT_FRIEND" = "You can’t call this person because they haven’t authorized you.";

/* SMS_FAILUREREASON */
"Sms::INVALID_CONFIRMATION_CODE" = "Invalid confirmation code";
"Sms::MISC_ERROR" = "Invalid phone number";

/* Conversation::PREMIUM_VIDEO_STATUS */

/*
"PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE" = "PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE";
"PV_RESULT_401_P2P_BLOCK_MESSAGE" = "PV_RESULT_401_P2P_BLOCK_MESSAGE";
*/

"PV_RESULT_403_PAID_SERVICE_BLOCK_MESSAGE" = "Your account has been blocked.";
"PV_RESULT_403_PAID_SERVICE_BLOCK_EXPLANATION" = "Please contact customer support.";

"PV_RESULT_405_GROUP_TOO_LARGE_MESSAGE" = "There are too many people in this call for group video.";
"PV_RESULT_405_GROUP_TOO_LARGE_EXPLANATION" = "You can only video call up to 9 people. Remove people from this group and try again.";

/*
"PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE" = "PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE";
*/

"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_MESSAGE" = "There are too many people in this call for group video.";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION_BETA" = "You can only video call up to 9 people. Remove people from this conversation and try again.";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION" = "Your group video calling subscription doesn’t cover this many people. Remove people from this conversation and try again.";

"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE_BETA" = "You need a subscription for group video calls.";
"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE" = "You need a subscription for group video calls.";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION_BETA" = "Want to make a group video call?";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION" = "Want to make a group video call?";

"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_MESSAGE" = "You’re already in a group video call.";
"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_EXPLANATION" = "You can only make one group video call at a time.";

"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_MESSAGE" = "You’ve reached the limit for this call.";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION_BETA" = "You’ve reached your 4-hour group video limit for this call.";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION" = "You’ve reached your 4-hour group video limit for this call. Check your account for details.";

"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_MESSAGE" = "You’ve reached your group video limit for today.";
"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_EXPLANATION" = "Group video calling temporarily suspended. You’ve reached your fair usage limit for today. Check your account for details.";

"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_MESSAGE" = "You’ve reached your group video limit for this month.";
"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_EXPLANATION" = "Group video calling temporarily suspended. You’ve reached your fair usage limit for this month. Check your account for details.";

/*
"PV_RESULT_430_GRACE_TIME_EXPIRED_MESSAGE" = "RESULT_430_GRACE_TIME_EXPIRED";
*/

"PV_RESULT_500_GENERAL_SERVICE_ERROR_MESSAGE" = "Group video is currently unavailable.";
"PV_RESULT_500_GENERAL_SERVICE_ERROR_EXPLANATION" = "An error has occurred. Please try again later.";

/*
"PV_RESULT_503_SERVICE_TIMEOUT_MESSAGE" = "RESULT_503_SERVICE_TIMEOUT";
*/

"PremiumVideoErrorRecovery_GetPremium_BETA" = "Get group video";
"PremiumVideoErrorRecovery_GetPremium" = "Get group video";
"PremiumVideoErrorRecovery_UpgradePremium" = "Upgrade";

/* ===== SKAccessSessionFailureReasonErrorDomain Errors ===== */

"AccessSession::NO_BALANCE" = "You need Skype Credit to use Skype WiFi.";
"AccessSession::LOGIN_FAILURE" = "We didn’t recognise your Skype Name and password.";
"AccessSession::WISPR_LOGIN_REJECTED" = "Invalid username or password.";

"SKYPEACCESS_NO_ACCOUNT" = "Please sign in with your Skype Account.";

"SKYPEACCESS_GENERIC_CONNECTION_ERROR" = "Couldn’t connect. Check WiFi signal strength or try a different hotspot.";
"SKYPEACCESS_GENERIC_FATAL_ERROR" = "This hotspot is not responding correctly. Please try a different hotspot.";

"SKYPEACCESS_SESSION_EXTEND_ERROR" = "Couldn’t extend session. Try connecting again.";

"SKYPEACCESS_SESSION_LOSTWIFI_MESSAGE" = "WiFi network “%@” is no longer available";
"SKYPEACCESS_SESSION_LOSTWIFI_EXPLANATION" = "To prevent unexpected charges, always disconnect properly before moving away from the hotspot or turning off your device.";

"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_MESSAGE" = "Please rejoin WiFi network “%@”";
"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_EXPLANATION" = "Skype WiFi will attempt to stop your internet connection. To prevent unexpected charges, always disconnect properly before moving away from the hotspot or turning off your device.";

"SKYPEACCESS_SESSION_LOSTWIFI_AUTO_END_MESSAGE" = "Your internet connection has been stopped.";

"ACCESS_PRICE_PER_MINUTE_FORMAT" = "%@ per minute";
"ACCESS_PRICE_PER_MINUTE_FREE" = "Free";

/*
 * ===========
 * SkyLib localization (Skype Kit messages sent by SkyLib to other clients)
 * ===========
 */

/* Message sent in the P2P chat after it has been migrated to a server-based chat, and seen by legacy client users. */
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P" = "has updated this group with a better chat experience.\nTo join and keep chatting get the latest download.\nGo to <a href=\"http://www.skype.com/updateme\">Skype.com/updateme</a>.";
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P_DOGFOOD" = "has updated this group with a better chat experience.\nTo join and keep chatting get the latest download.\nGo to https://microsoft.sharepoint.com/teams/DogfoodSkype/.";

/* Message sent in the server-based chat as first message. Used to link the history of both conversations. The '%1' is replaced with the ID of the old chat. */
"LOCALIZED_UPGRADE_MESSAGE_IN_SERVER_BASED" = "Click <a href=\"skype:?chat&amp;id=%1\">here</a> to see previous history.";
